# 판다스의 시리즈와 데이터프레임 만들기

## 시리즈 자료 구조

단축키 정리 : esc키 눌러서 명령모드에서 실행
- a : 현재 셀의 위쪽에 셀이 추가
- b : 현재 셀의 아래쪽에 셀 추가
- m : 현재 셀을 마크다운 셀 변경
- y : 현재 셀을 명령 셀 변경
- tap : 자동 완성 기능

In [44]:
import pandas as pd
import numpy as np

In [15]:
arr = np.array([1,2,3,4])
type(arr)

numpy.ndarray

In [16]:
pd.Series(arr)

0    1
1    2
2    3
3    4
dtype: int64

In [18]:
ss = pd.Series(arr)
type(ss)

pandas.core.series.Series

In [19]:
ss

0    1
1    2
2    3
3    4
dtype: int64

## DataFrame 자료구조

### 방법1. 리스트로 만들기

In [34]:
company1 = [['삼성', 2000, '스마트폰'],
           ['현대', 2500, '자동차'],
           ['LG', 3000, '건조기'],
            ['LG', 7000, '건조기'],
           ]
company1

[['삼성', 2000, '스마트폰'],
 ['현대', 2500, '자동차'],
 ['LG', 3000, '건조기'],
 ['LG', 7000, '건조기']]

In [38]:
pd.DataFrame(company1)

    0     1     2
0  삼성  2000  스마트폰
1  현대  2500   자동차
2  LG  3000   건조기
3  LG  7000   건조기

In [39]:
df1 = pd.DataFrame(company1)
df1

    0     1     2
0  삼성  2000  스마트폰
1  현대  2500   자동차
2  LG  3000   건조기
3  LG  7000   건조기

## 컬럼 제목 만들기

In [40]:
df1.columns = ['기업명', '매출액', '업종']
df1

  기업명   매출액    업종
0  삼성  2000  스마트폰
1  현대  2500   자동차
2  LG  3000   건조기
3  LG  7000   건조기

In [41]:
# 2d 데이터를 컬럼명을 부여하여 DF 만들기
df1 = pd.DataFrame(company1,columns=['기업명', '매출액', '업종'])
df1

  기업명   매출액    업종
0  삼성  2000  스마트폰
1  현대  2500   자동차
2  LG  3000   건조기
3  LG  7000   건조기

### 방법2. dict로 DF만들기
- key value로 만들기

In [29]:
company2 = {'기업명':['삼성', '현대', 'LG'], 
            '매출액': [2000, 2500, 3000], 
            '업종': ['스마트폰', '자동차', '건조기']
           }

In [30]:
df2 = pd.DataFrame(company2)
df2

  기업명   매출액    업종
0  삼성  2000  스마트폰
1  현대  2500   자동차
2  LG  3000   건조기

In [37]:
df2.columns

Index(['기업명', '매출액', '업종'], dtype='object')

### 특정컬럼으로 인덱스

In [36]:
df1['기업명']

0    삼성
1    현대
2    LG
Name: 기업명, dtype: object

In [35]:
df2.index = df1['기업명']
df2

    기업명   매출액    업종
기업명
삼성   삼성  2000  스마트폰
현대   현대  2500   자동차
LG   LG  3000   건조기

[문제1] 다음의 정보를 데이터 프레임으로 만들기
이름, 포지션, 나이
진, 서브보컬, 28
슈가, 리드래퍼, 28
제이홉, 서브래퍼, 27
RM, 리더, 26
지민, 리드보컬, 25
뷔, 리드댄서, 25
정국, 리드댄서,23

In [46]:
singer = [['진', '서브보컬', 28],
           ['슈가', '리드래퍼', 28],
           ['제이홉', '서브래퍼', 27],
           ['RM', '리더', 26],
           ['지민', '리드보컬', 25],
           ['뷔', '리드댄서', 25],
           ['정국', '리드댄서',23],
           ]
singer

[['진', '서브보컬', 28],
 ['슈가', '리드래퍼', 28],
 ['제이홉', '서브래퍼', 27],
 ['RM', '리더', 26],
 ['지민', '리드보컬', 25],
 ['뷔', '리드댄서', 25],
 ['정국', '리드댄서', 23]]

In [47]:
df1 = pd.DataFrame(singer,columns=['이름', '포지션', '나이'])
df1

    이름   포지션  나이
0    진  서브보컬  28
1   슈가  리드래퍼  28
2  제이홉  서브래퍼  27
3   RM    리더  26
4   지민  리드보컬  25
5    뷔  리드댄서  25
6   정국  리드댄서  23

[문제2] 데이터 프레임 만들기
- numpy 1~39까지 2의 홀수로 저장
- 4개의 컬럼으로 이뤄진 DataFrame으로 만들기
- 컬럼 이름 '1열','2열', '3열,'4열' 로 적용하기

In [60]:
# np.arrange(start, stop, step)
nums = np.arange(1, 40, 2)
# 5 X 4 2D 행령모양 만들기
# nums.reshape(5, 4) 
# nums.reshape(-1, 4)

In [61]:
df1 = pd.DataFrame(nums.reshape(-1, 4), columns=['1열', '2열', '3열', '4열'])
df1

   1열  2열  3열  4열
0   1   3   5   7
1   9  11  13  15
2  17  19  21  23
3  25  27  29  31
4  33  35  37  39